public class Lab3_1_1 {
    /*Напишіть програму, що друкує номер першого нульового елемента заданого масиву 
    чи повідомлення про те, що масив не містить нульових елементів. */
    public static void main(String[] args) {
        int[] arr = {1, 2, 0, 4, 5}; // заданий масив
        int index = -1; // індекс першого нульового елемента, починаємо з -1 як індикатора того, що нульових елементів не знайдено
        
        for (int i = 0; i < arr.length; i++) {
            if (arr[i] == 0) {
                index = i; // зберігаємо індекс першого нульового елемента
                break; // виходимо з циклу, якщо знайдено нульовий елемент
            }
        }
        
        if (index != -1) {
            System.out.println("Номер першого нульового елемента: " + index);
        } else {
            System.out.println("Масив не містить нульових елементів.");
        }
    }
}

